SpenceKonde/megaTinyCore/megaavr/boards.txt
# Xplained boards with Tiny-1 chips

Xplained416.name=Attiny416 Xplained Nano (optiboot)
Xplained416.build.mcu=attiny416
Xplained416.build.board=attinyxy6
Xplained416.build.core=arduino
Xplained416.build.variant=txy6
Xplained416.build.f_cpu=20000000
Xplained416.build.text_section_start=.text=0x200
Xplained416.build.extra_flags={build.millis} -DNO_EXTERNAL_I2C_PULLUP -DUSE_TIMERD0_PWM {build.dacvref} {build.neopixelport} {build.uartpins} {build.twipins} {build.spipins} {build.uartvoltage}
Xplained416.upload.tool=avrdude
Xplained416.upload.workaround=
Xplained416.upload.speed=57600
Xplained416.upload.maximum_size=3584
Xplained416.upload.maximum_data_size=256
Xplained416.upload.protocol=arduino
Xplained416.upload.extra_params=-D
Xplained416.bootloader.file=optiboot_x/optiboot_xplained416.hex
Xplained416.bootloader.flashcommand=-Uflash:w:{runtime.platform.path}/bootloaders/{bootloader.file}:i
Xplained416.bootloader.tool=avrdude
Xplained416.bootloader.BOOTEND=0x2
Xplained416.bootloader.OSCCFG=0x02
Xplained416.bootloader.WDTCFG=0x00
Xplained416.bootloader.BODCFG=0b00000000
Xplained416.bootloader.TCD0CFG=0x00
Xplained416.bootloader.SYSCFG0=0xC9
Xplained416.bootloader.SYSCFG1=0x03
Xplained416.bootloader.APPEND=0x00

Xplained416.menu.dacvref.0v55=0.55V
Xplained416.menu.dacvref.1v1=1.10V
Xplained416.menu.dacvref.1v5=1.50V
Xplained416.menu.dacvref.2v5=2.50V
Xplained416.menu.dacvref.4v3=4.30V
Xplained416.menu.dacvref.disabled=Disabled (saves flash)
Xplained416.menu.dacvref.0v55.build.dacvref=-DDACVREF=0
Xplained416.menu.dacvref.1v1.build.dacvref=-DDACVREF=1
Xplained416.menu.dacvref.1v5.build.dacvref=-DDACVREF=4
Xplained416.menu.dacvref.2v5.build.dacvref=-DDACVREF=2
Xplained416.menu.dacvref.4v3.build.dacvref=-DDACVREF=3
Xplained416.menu.dacvref.disabled.build.dacvref=

Xplained416.menu.neopixelport.porta=PORTA (pins 0~3,14~17)
Xplained416.menu.neopixelport.portb=PORTB (pins 4~9)
Xplained416.menu.neopixelport.portc=PORTC (pins 10~13)
Xplained416.menu.neopixelport.porta.build.neopixelport=-DNEOPIXELPORT=VPORTA.OUT
Xplained416.menu.neopixelport.portb.build.neopixelport=-DNEOPIXELPORT=VPORTB.OUT
Xplained416.menu.neopixelport.portc.build.neopixelport=-DNEOPIXELPORT=VPORTC.OUT

Xplained416.menu.millis.enabled=Enabled
Xplained416.menu.millis.disabled=Disabled (saves flash)
Xplained416.menu.millis.enabled.build.millis=
Xplained416.menu.millis.disabled.build.millis=-DDISABLE_MILLIS
Xplained416.menu.millis.enabled=Enabled (default timer)
Xplained416.menu.millis.disabled=Disabled (saves flash)
Xplained416.menu.millis.timera=TCA0 (default)
Xplained416.menu.millis.timerd=TCD0 (1-series, breaks PWM on 10,11)
Xplained416.menu.millis.timerb0=TCB0 (breaks tone() and Servo)
Xplained416.menu.millis.enabled.build.millis=-DMILLIS_USE_TIMERA0
Xplained416.menu.millis.rtc=RTC (no micros)
Xplained416.menu.millis.rtcxtal=RTC w/w32khz xtal (no micros)
Xplained416.menu.millis.disabled.build.millis=-DDISABLE_MILLIS -DMILLIS_USE_TIMERD0_A0
Xplained416.menu.millis.timera.build.millis=-DMILLIS_USE_TIMERA0
Xplained416.menu.millis.timerd.build.millis=-DMILLIS_USE_TIMERD0
Xplained416.menu.millis.timerb0.build.millis=-DMILLIS_USE_TIMERB0
Xplained416.menu.millis.rtc.build.millis=-DMILLIS_USE_TIMERRTC
Xplained416.menu.millis.rtcxtal.build.millis=-DMILLIS_USE_TIMERRTC_XTAL

Xplained416.menu.uartvoltage.5v=Closer to 5v
Xplained416.menu.uartvoltage.3v=Closer to 3v
Xplained416.menu.uartvoltage.5v.build.uartvoltage=
Xplained416.menu.uartvoltage.3v.build.uartvoltage=-DUARTBAUD3V

Xplained416.menu.uartpins.standard=TX:7, RX:6
Xplained416.menu.uartpins.alternate=TX:14, RX:15
Xplained416.menu.uartpins.alternate.build.uartpins=-DUARTREMAP
Xplained416.menu.uartpins.alternate.bootloader.uartswap=_alt
Xplained416.menu.uartpins.standard.build.uartpins=
Xplained416.menu.uartpins.standard.bootloader.uartswap=
Xplained416.menu.twipins.standard=SDA:8, SCL:9
Xplained416.menu.twipins.alternate=SDA:14, SCL:15
Xplained416.menu.twipins.alternate.build.twipins=-DTWIREMAP
Xplained416.menu.twipins.standard.build.twipins=
Xplained416.menu.spipins.standard=SCK:16, MISO:15, MOSI:14
Xplained416.menu.spipins.alternate=SCK:10, MISO:11, MOSI:12
Xplained416.menu.spipins.alternate.build.spipins=-DSPIREMAP
Xplained416.menu.spipins.standard.build.spipins=


Xplained817.name=Attiny817 Xplained Mini (optiboot)
Xplained817.build.mcu=attiny817
Xplained817.build.board=attinyxy7
Xplained817.build.core=arduino
Xplained817.build.variant=txy7
Xplained817.build.f_cpu=20000000
Xplained817.build.text_section_start=.text=0x200
Xplained817.build.extra_flags={build.millis} -DNO_EXTERNAL_I2C_PULLUP -DUSE_TIMERD0_PWM {build.dacvref} {build.neopixelport} {build.uartpins} {build.twipins} {build.spipins} {build.uartvoltage}
Xplained817.upload.tool=avrdude
Xplained817.upload.workaround=
Xplained817.upload.speed=57600
Xplained817.upload.maximum_size=7680
Xplained817.upload.maximum_data_size=512
Xplained817.upload.protocol=arduino
Xplained817.upload.extra_params=-D
Xplained817.bootloader.file=optiboot_x/optiboot_xplained817.hex
Xplained817.bootloader.flashcommand=-Uflash:w:{runtime.platform.path}/bootloaders/{bootloader.file}:i
Xplained817.bootloader.tool=avrdude
Xplained817.bootloader.BOOTEND=0x2
Xplained817.bootloader.OSCCFG=0x02
Xplained817.bootloader.WDTCFG=0x00
Xplained817.bootloader.BODCFG=0b00000000
Xplained817.bootloader.TCD0CFG=0x00
Xplained817.bootloader.SYSCFG0=0xC9
Xplained817.bootloader.SYSCFG1=0x03
Xplained817.bootloader.APPEND=0x00

Xplained817.menu.dacvref.0v55=0.55V
Xplained817.menu.dacvref.1v1=1.10V
Xplained817.menu.dacvref.1v5=1.50V
Xplained817.menu.dacvref.2v5=2.50V
Xplained817.menu.dacvref.4v3=4.30V
Xplained817.menu.dacvref.disabled=Disabled (saves flash)
Xplained817.menu.dacvref.0v55.build.dacvref=-DDACVREF=0
Xplained817.menu.dacvref.1v1.build.dacvref=-DDACVREF=1
Xplained817.menu.dacvref.1v5.build.dacvref=-DDACVREF=4
Xplained817.menu.dacvref.2v5.build.dacvref=-DDACVREF=2
Xplained817.menu.dacvref.4v3.build.dacvref=-DDACVREF=3
Xplained817.menu.dacvref.disabled.build.dacvref=

Xplained817.menu.millis.enabled=Enabled
Xplained817.menu.millis.disabled=Disabled (saves flash)
Xplained817.menu.millis.enabled.build.millis=
Xplained817.menu.millis.disabled.build.millis=-DDISABLE_MILLIS

Xplained817.menu.millis.enabled=Enabled (default timer)
Xplained817.menu.millis.disabled=Disabled (saves flash)
Xplained817.menu.millis.timera=TCA0 (default)
Xplained817.menu.millis.timerd=TCD0 (1-series, breaks PWM on 12,13)
Xplained817.menu.millis.timerb0=TCB0 (breaks tone() and Servo)
Xplained817.menu.millis.rtc=RTC (no micros)
Xplained817.menu.millis.rtcxtal=RTC w/w32khz xtal (no micros)
Xplained817.menu.millis.enabled.build.millis=-DMILLIS_USE_TIMERA0
Xplained817.menu.millis.disabled.build.millis=-DDISABLE_MILLIS -DMILLIS_USE_TIMERD0_A0
Xplained817.menu.millis.timera.build.millis=-DMILLIS_USE_TIMERA0
Xplained817.menu.millis.timerd.build.millis=-DMILLIS_USE_TIMERD0
Xplained817.menu.millis.timerb0.build.millis=-DMILLIS_USE_TIMERB0
Xplained817.menu.millis.rtc.build.millis=-DMILLIS_USE_TIMERRTC
Xplained817.menu.millis.rtcxtal.build.millis=-DMILLIS_USE_TIMERRTC_XTAL

