SpenceKonde/megaTinyCore/megaavr/boards.txt
Xplained817.menu.neopixelport.porta=PORTA (pins 0~3,18~21)
Xplained817.menu.neopixelport.portb=PORTB (pins 4~11)
Xplained817.menu.neopixelport.portc=PORTC (pins 12~17)
Xplained817.menu.neopixelport.porta.build.neopixelport=-DNEOPIXELPORT=VPORTA.OUT
Xplained817.menu.neopixelport.portb.build.neopixelport=-DNEOPIXELPORT=VPORTB.OUT
Xplained817.menu.neopixelport.portc.build.neopixelport=-DNEOPIXELPORT=VPORTC.OUT

Xplained817.menu.uartvoltage.5v=Closer to 5v
Xplained817.menu.uartvoltage.3v=Closer to 3v
Xplained817.menu.uartvoltage.5v.build.uartvoltage=
Xplained817.menu.uartvoltage.3v.build.uartvoltage=-DUARTBAUD3V

Xplained817.menu.uartpins.standard=TX:9, RX:8
Xplained817.menu.uartpins.alternate=TX:18, RX:19
Xplained817.menu.uartpins.alternate.build.uartpins=-DUARTREMAP
Xplained817.menu.uartpins.alternate.bootloader.uartswap=_alt
Xplained817.menu.uartpins.standard.build.uartpins=
Xplained817.menu.uartpins.standard.bootloader.uartswap=
Xplained817.menu.twipins.standard=SDA:10, SCL:11
Xplained817.menu.twipins.alternate=SDA:18, SCL:19
Xplained817.menu.twipins.alternate.build.twipins=-DTWIREMAP
Xplained817.menu.twipins.standard.build.twipins=
Xplained817.menu.spipins.standard=SCK:20, MISO:19, MOSI:18
Xplained817.menu.spipins.alternate=SCK:12, MISO:13, MOSI:14
Xplained817.menu.spipins.alternate.build.spipins=-DSPIREMAP
Xplained817.menu.spipins.standard.build.spipins=

# Separate board types for chips with Optiboot.  Reduces menu clutter.

atxy7o.name=ATtiny3217/1617/1607/817/807/417 (Optiboot)
atxy7o.upload.speed=115200

atxy7o.menu.chip.3217=ATtiny3217
atxy7o.menu.chip.3217.build.mcu=attiny3217
atxy7o.menu.chip.3217.upload.maximum_size=32256
atxy7o.menu.chip.3217.upload.maximum_data_size=2048
atxy7o.menu.chip.1617=ATtiny1617
atxy7o.menu.chip.1617.build.mcu=attiny1617
atxy7o.menu.chip.1617.upload.maximum_size=15872
atxy7o.menu.chip.1617.upload.maximum_data_size=2048
atxy7o.menu.chip.817=ATtiny817
atxy7o.menu.chip.817.build.mcu=attiny817
atxy7o.menu.chip.817.upload.maximum_size=7680
atxy7o.menu.chip.817.upload.maximum_data_size=512
atxy7o.menu.chip.417=ATtiny417
atxy7o.menu.chip.417.build.mcu=attiny417
atxy7o.menu.chip.417.upload.maximum_size=3584
atxy7o.menu.chip.417.upload.maximum_data_size=256
atxy7o.menu.chip.1607=ATtiny1607
atxy7o.menu.chip.1607.build.mcu=attiny1607
atxy7o.menu.chip.1607.upload.maximum_size=15872
atxy7o.menu.chip.1607.upload.maximum_data_size=1024
atxy7o.menu.chip.807=ATtiny807
atxy7o.menu.chip.807.build.mcu=attiny807
atxy7o.menu.chip.807.upload.maximum_size=7680
atxy7o.menu.chip.807.upload.maximum_data_size=512

atxy7o.menu.clock.20=20 MHz
atxy7o.menu.clock.16=16 MHz
atxy7o.menu.clock.10=10 MHz
atxy7o.menu.clock.8=8 MHz
atxy7o.menu.clock.5=5 MHz
atxy7o.menu.clock.4=4 MHz
atxy7o.menu.clock.1=1 MHz
atxy7o.menu.clock.20.build.f_cpu=20000000L
atxy7o.menu.clock.16.build.f_cpu=16000000L
atxy7o.menu.clock.10.build.f_cpu=10000000L
atxy7o.menu.clock.8.build.f_cpu=8000000L
atxy7o.menu.clock.5.build.f_cpu=5000000L
atxy7o.menu.clock.4.build.f_cpu=4000000L
atxy7o.menu.clock.1.build.f_cpu=1000000L
atxy7o.menu.clock.20.bootloader.OSCCFG=0x02
atxy7o.menu.clock.16.bootloader.OSCCFG=0x01
atxy7o.menu.clock.10.bootloader.OSCCFG=0x02
atxy7o.menu.clock.8.bootloader.OSCCFG=0x01
atxy7o.menu.clock.5.bootloader.OSCCFG=0x02
atxy7o.menu.clock.4.bootloader.OSCCFG=0x01
atxy7o.menu.clock.1.bootloader.OSCCFG=0x01

atxy7o.menu.bodvoltage.1v8=1.8V
atxy7o.menu.bodvoltage.2v15=2.15V
atxy7o.menu.bodvoltage.2v6=2.6V
atxy7o.menu.bodvoltage.2v95=2.95V
atxy7o.menu.bodvoltage.3v3=3.30V
atxy7o.menu.bodvoltage.3v7=3.70V
atxy7o.menu.bodvoltage.4v0=4.00V
atxy7o.menu.bodvoltage.4v3=4.30V
atxy7o.menu.bodvoltage.4v3.bootloader.bodlevbits=111
atxy7o.menu.bodvoltage.4v0.bootloader.bodlevbits=110
atxy7o.menu.bodvoltage.3v7.bootloader.bodlevbits=101
atxy7o.menu.bodvoltage.3v3.bootloader.bodlevbits=100
atxy7o.menu.bodvoltage.2v95.bootloader.bodlevbits=011
atxy7o.menu.bodvoltage.2v6.bootloader.bodlevbits=010
atxy7o.menu.bodvoltage.2v15.bootloader.bodlevbits=001
atxy7o.menu.bodvoltage.1v8.bootloader.bodlevbits=000
atxy7o.menu.bodmodeactive.disabled=Disabled
atxy7o.menu.bodmodeactive.enabled=Enabled
atxy7o.menu.bodmodeactive.sampled=Sampled
atxy7o.menu.bodmodeactive.enabledhold=Enabled hold wakeup
atxy7o.menu.bodmodesleep.disabled=Disabled
atxy7o.menu.bodmodesleep.enabled=Enabled
atxy7o.menu.bodmodesleep.sampled=Sampled
atxy7o.menu.bodmodeactive.disabled.bootloader.bodactivebits=00
atxy7o.menu.bodmodeactive.enabled.bootloader.bodactivebits=01
atxy7o.menu.bodmodeactive.sampled.bootloader.bodactivebits=10
atxy7o.menu.bodmodeactive.enabledhold.bootloader.bodactivebits=11
atxy7o.menu.bodmodesleep.disabled.bootloader.bodsleepbits=00
atxy7o.menu.bodmodesleep.enabled.bootloader.bodsleepbits=01
atxy7o.menu.bodmodesleep.sampled.bootloader.bodsleepbits=10

atxy7o.menu.dacvref.0v55=0.55V
atxy7o.menu.dacvref.1v1=1.10V
atxy7o.menu.dacvref.1v5=1.50V
atxy7o.menu.dacvref.2v5=2.50V
atxy7o.menu.dacvref.4v3=4.30V
atxy7o.menu.dacvref.disabled=Disabled (saves flash)
atxy7o.menu.dacvref.0v55.build.dacvref=-DDACVREF=0
atxy7o.menu.dacvref.1v1.build.dacvref=-DDACVREF=1
atxy7o.menu.dacvref.1v5.build.dacvref=-DDACVREF=4
atxy7o.menu.dacvref.2v5.build.dacvref=-DDACVREF=2
atxy7o.menu.dacvref.4v3.build.dacvref=-DDACVREF=3
atxy7o.menu.dacvref.disabled.build.dacvref=

atxy7o.menu.millis.enabled=Enabled (default timer)
atxy7o.menu.millis.disabled=Disabled (saves flash)
atxy7o.menu.millis.timera=TCA0 (default)
atxy7o.menu.millis.timerd=TCD0 (1-series, breaks PWM on 12,13)
atxy7o.menu.millis.timerb0=TCB0 (breaks tone() and Servo)
atxy7o.menu.millis.timerb1=TCB1 (3217,1617 only)
atxy7o.menu.millis.rtc=RTC (no micros)
atxy7o.menu.millis.rtcxtal=RTC w/w32khz xtal (no micros)
atxy7o.menu.millis.enabled.build.millis=-DMILLIS_USE_TIMERA0
atxy7o.menu.millis.disabled.build.millis=-DDISABLE_MILLIS -DMILLIS_USE_TIMERD0_A0
atxy7o.menu.millis.timera.build.millis=-DMILLIS_USE_TIMERA0
atxy7o.menu.millis.timerd.build.millis=-DMILLIS_USE_TIMERD0
atxy7o.menu.millis.timerb0.build.millis=-DMILLIS_USE_TIMERB0
atxy7o.menu.millis.timerb1.build.millis=-DMILLIS_USE_TIMERB1
atxy7o.menu.millis.rtc.build.millis=-DMILLIS_USE_TIMERRTC
atxy7o.menu.millis.rtcxtal.build.millis=-DMILLIS_USE_TIMERRTC_XTAL

