SpenceKonde/megaTinyCore/megaavr/boards.txt
atxy7o.menu.neopixelport.porta=PORTA (pins 0~3,18~21)
atxy7o.menu.neopixelport.portb=PORTB (pins 4~11)
atxy7o.menu.neopixelport.portc=PORTC (pins 12~17)
atxy7o.menu.neopixelport.porta.build.neopixelport=-DNEOPIXELPORT=VPORTA.OUT
atxy7o.menu.neopixelport.portb.build.neopixelport=-DNEOPIXELPORT=VPORTB.OUT
atxy7o.menu.neopixelport.portc.build.neopixelport=-DNEOPIXELPORT=VPORTC.OUT

atxy7o.menu.resetpin.UPDI=UPDI (powercycle to enter bootloader)
atxy7o.menu.resetpin.UPDI.bootloader.file=optiboot_x/optiboot_txy7{bootloader.uartswap}.hex
atxy7o.menu.resetpin.UPDI.bootloader.resetpinbits=01
atxy7o.menu.resetpin.reset=Reset (DANGER - Read docs first!)
atxy7o.menu.resetpin.reset.bootloader.file=optiboot_x/optiboot_txy7{bootloader.uartswap}_rst.hex
atxy7o.menu.resetpin.reset.bootloader.resetpinbits=10
atxy7o.menu.resetpin.gpio=IO (DANGER - Read docs first! powercycle to enter bootloader)
atxy7o.menu.resetpin.gpio.bootloader.file=optiboot_x/optiboot_txy2{bootloader.uartswap}.hex
atxy7o.menu.resetpin.gpio.bootloader.resetpinbits=00

atxy7o.menu.uartvoltage.5v=Closer to 5v
atxy7o.menu.uartvoltage.3v=Closer to 3v
atxy7o.menu.uartvoltage.5v.build.uartvoltage=
atxy7o.menu.uartvoltage.3v.build.uartvoltage=-DUARTBAUD3V

atxy7o.menu.uartpins.standard=TX:9, RX:8
atxy7o.menu.uartpins.alternate=TX:18, RX:19
atxy7o.menu.uartpins.alternate.build.uartpins=-DUARTREMAP
atxy7o.menu.uartpins.alternate.bootloader.uartswap=_alt
atxy7o.menu.uartpins.standard.build.uartpins=
atxy7o.menu.uartpins.standard.bootloader.uartswap=
atxy7o.menu.twipins.standard=SDA:10, SCL:11
atxy7o.menu.twipins.alternate=SDA:18, SCL:19
atxy7o.menu.twipins.alternate.build.twipins=-DTWIREMAP
atxy7o.menu.twipins.standard.build.twipins=
atxy7o.menu.spipins.standard=SCK:20, MISO:19, MOSI:18
atxy7o.menu.spipins.alternate=SCK:12, MISO:13, MOSI:14
atxy7o.menu.spipins.alternate.build.spipins=-DSPIREMAP
atxy7o.menu.spipins.standard.build.spipins=

atxy7o.upload.tool=avrdude

atxy7o.build.board=attinyxy7
atxy7o.build.core=arduino
atxy7o.build.variant=txy7
atxy7o.build.extra_flags={build.millis} -DNO_EXTERNAL_I2C_PULLUP -DUSE_TIMERD0_PWM {build.dacvref} {build.neopixelport} {build.uartpins} {build.twipins} {build.spipins} {build.uartvoltage}
atxy7o.build.export_merged_output=true

atxy7o.bootloader.WDTCFG=0x00
atxy7o.bootloader.BODCFG=0b{bootloader.bodlevbits}0{bootloader.bodactivebits}{bootloader.bodsleepbits}
atxy7o.bootloader.TCD0CFG=0x00
atxy7o.bootloader.SYSCFG0=0b1100{bootloader.resetpinbits}01
atxy7o.bootloader.SYSCFG1=0x03
atxy7o.bootloader.APPEND=0x00
atxy7o.bootloader.BOOTEND=0x02



atxy7o.upload.protocol=arduino
atxy7o.upload.extra_params=-D
atxy7o.upload.workaround=
atxy7o.build.text_section_start=.text=0x200
atxy7o.bootloader.flashcommand=-Uflash:w:{runtime.platform.path}/bootloaders/{bootloader.file}:i
atxy7o.bootloader.tool=avrdude

##############################################################

atxy6o.name=ATtiny3216/1616/1606/816/806/416/406 (optiboot)
atxy6o.upload.speed=115200

atxy6o.menu.chip.3216=ATtiny3216
atxy6o.menu.chip.3216.build.mcu=attiny3216
atxy6o.menu.chip.3216.upload.maximum_size=32768
atxy6o.menu.chip.3216.upload.maximum_data_size=2048
atxy6o.menu.chip.1616=ATtiny1616
atxy6o.menu.chip.1616.build.mcu=attiny1616
atxy6o.menu.chip.1616.upload.maximum_size=16384
atxy6o.menu.chip.1616.upload.maximum_data_size=2048
atxy6o.menu.chip.816=ATtiny816
atxy6o.menu.chip.816.build.mcu=attiny816
atxy6o.menu.chip.816.upload.maximum_size=8192
atxy6o.menu.chip.816.upload.maximum_data_size=512
atxy6o.menu.chip.416=ATtiny416
atxy6o.menu.chip.416.build.mcu=attiny416
atxy6o.menu.chip.416.upload.maximum_size=4096
atxy6o.menu.chip.416.upload.maximum_data_size=256

atxy6o.menu.chip.1606=ATtiny1606
atxy6o.menu.chip.1606.build.mcu=attiny1606
atxy6o.menu.chip.1606.upload.maximum_size=16384
atxy6o.menu.chip.1606.upload.maximum_data_size=1024
atxy6o.menu.chip.806=ATtiny806
atxy6o.menu.chip.806.build.mcu=attiny806
atxy6o.menu.chip.806.upload.maximum_size=8192
atxy6o.menu.chip.806.upload.maximum_data_size=512
atxy6o.menu.chip.406=ATtiny406
atxy6o.menu.chip.406.build.mcu=attiny406
atxy6o.menu.chip.406.upload.maximum_size=4096
atxy6o.menu.chip.406.upload.maximum_data_size=256

atxy6o.menu.clock.20=20 MHz
atxy6o.menu.clock.16=16 MHz
atxy6o.menu.clock.10=10 MHz
atxy6o.menu.clock.8=8 MHz
atxy6o.menu.clock.5=5 MHz
atxy6o.menu.clock.4=4 MHz
atxy6o.menu.clock.1=1 MHz
atxy6o.menu.clock.20.build.f_cpu=20000000L
atxy6o.menu.clock.16.build.f_cpu=16000000L
atxy6o.menu.clock.10.build.f_cpu=10000000L
atxy6o.menu.clock.8.build.f_cpu=8000000L
atxy6o.menu.clock.5.build.f_cpu=5000000L
atxy6o.menu.clock.4.build.f_cpu=4000000L
atxy6o.menu.clock.1.build.f_cpu=1000000L
atxy6o.menu.clock.20.bootloader.OSCCFG=0x02
atxy6o.menu.clock.16.bootloader.OSCCFG=0x01
atxy6o.menu.clock.10.bootloader.OSCCFG=0x02
atxy6o.menu.clock.8.bootloader.OSCCFG=0x01
atxy6o.menu.clock.5.bootloader.OSCCFG=0x02
atxy6o.menu.clock.4.bootloader.OSCCFG=0x01
atxy6o.menu.clock.1.bootloader.OSCCFG=0x01

atxy6o.menu.dacvref.0v55=0.55V
atxy6o.menu.dacvref.1v1=1.10V
atxy6o.menu.dacvref.1v5=1.50V
atxy6o.menu.dacvref.2v5=2.50V
atxy6o.menu.dacvref.4v3=4.30V
atxy6o.menu.dacvref.disabled=Disabled (saves flash)
atxy6o.menu.dacvref.0v55.build.dacvref=-DDACVREF=0
atxy6o.menu.dacvref.1v1.build.dacvref=-DDACVREF=1
atxy6o.menu.dacvref.1v5.build.dacvref=-DDACVREF=4
atxy6o.menu.dacvref.2v5.build.dacvref=-DDACVREF=2
atxy6o.menu.dacvref.4v3.build.dacvref=-DDACVREF=3
atxy6o.menu.dacvref.disabled.build.dacvref=

atxy6o.menu.millis.enabled=Enabled (default timer)
atxy6o.menu.millis.disabled=Disabled (saves flash)
atxy6o.menu.millis.timera=TCA0 (default)
atxy6o.menu.millis.timerd=TCD0 (1-series, breaks PWM on 10,11)
atxy6o.menu.millis.timerb0=TCB0 (breaks tone() and Servo)
atxy6o.menu.millis.timerb1=TCB1 (3216,1616 only)
atxy6o.menu.millis.rtc=RTC (no micros)
atxy6o.menu.millis.rtcxtal=RTC w/w32khz xtal (no micros)
atxy6o.menu.millis.enabled.build.millis=-DMILLIS_USE_TIMERA0
atxy6o.menu.millis.disabled.build.millis=-DDISABLE_MILLIS -DMILLIS_USE_TIMERD0_A0
atxy6o.menu.millis.timera.build.millis=-DMILLIS_USE_TIMERA0
atxy6o.menu.millis.timerd.build.millis=-DMILLIS_USE_TIMERD0
atxy6o.menu.millis.timerb0.build.millis=-DMILLIS_USE_TIMERB0
atxy6o.menu.millis.timerb1.build.millis=-DMILLIS_USE_TIMERB1
atxy6o.menu.millis.rtc.build.millis=-DMILLIS_USE_TIMERRTC
atxy6o.menu.millis.rtcxtal.build.millis=-DMILLIS_USE_TIMERRTC_XTAL

atxy6o.menu.neopixelport.porta=PORTA (pins 0~3,14~17)
atxy6o.menu.neopixelport.portb=PORTB (pins 4~9)
atxy6o.menu.neopixelport.portc=PORTC (pins 10~13)
atxy6o.menu.neopixelport.porta.build.neopixelport=-DNEOPIXELPORT=VPORTA.OUT
atxy6o.menu.neopixelport.portb.build.neopixelport=-DNEOPIXELPORT=VPORTB.OUT
atxy6o.menu.neopixelport.portc.build.neopixelport=-DNEOPIXELPORT=VPORTC.OUT

atxy6o.menu.bodvoltage.1v8=1.8V
atxy6o.menu.bodvoltage.2v15=2.15V
atxy6o.menu.bodvoltage.2v6=2.6V
atxy6o.menu.bodvoltage.2v95=2.95V
atxy6o.menu.bodvoltage.3v3=3.30V
atxy6o.menu.bodvoltage.3v7=3.70V
atxy6o.menu.bodvoltage.4v0=4.00V
atxy6o.menu.bodvoltage.4v3=4.30V
atxy6o.menu.bodvoltage.4v3.bootloader.bodlevbits=111
atxy6o.menu.bodvoltage.4v0.bootloader.bodlevbits=110
atxy6o.menu.bodvoltage.3v7.bootloader.bodlevbits=101
atxy6o.menu.bodvoltage.3v3.bootloader.bodlevbits=100
atxy6o.menu.bodvoltage.2v95.bootloader.bodlevbits=011
atxy6o.menu.bodvoltage.2v6.bootloader.bodlevbits=010
atxy6o.menu.bodvoltage.2v15.bootloader.bodlevbits=001
atxy6o.menu.bodvoltage.1v8.bootloader.bodlevbits=000
atxy6o.menu.bodmodeactive.disabled=Disabled
atxy6o.menu.bodmodeactive.enabled=Enabled
atxy6o.menu.bodmodeactive.sampled=Sampled
atxy6o.menu.bodmodeactive.enabledhold=Enabled hold wakeup
atxy6o.menu.bodmodesleep.disabled=Disabled
atxy6o.menu.bodmodesleep.enabled=Enabled
atxy6o.menu.bodmodesleep.sampled=Sampled
atxy6o.menu.bodmodeactive.disabled.bootloader.bodactivebits=00
atxy6o.menu.bodmodeactive.enabled.bootloader.bodactivebits=01
atxy6o.menu.bodmodeactive.sampled.bootloader.bodactivebits=10
atxy6o.menu.bodmodeactive.enabledhold.bootloader.bodactivebits=11
atxy6o.menu.bodmodesleep.disabled.bootloader.bodsleepbits=00
atxy6o.menu.bodmodesleep.enabled.bootloader.bodsleepbits=01
atxy6o.menu.bodmodesleep.sampled.bootloader.bodsleepbits=10

atxy6o.menu.uartvoltage.5v=Closer to 5v
atxy6o.menu.uartvoltage.3v=Closer to 3v
atxy6o.menu.uartvoltage.5v.build.uartvoltage=
atxy6o.menu.uartvoltage.3v.build.uartvoltage=-DUARTBAUD3V

atxy6o.menu.uartpins.standard=TX:7, RX:6
atxy6o.menu.uartpins.alternate=TX:14, RX:15
atxy6o.menu.uartpins.alternate.build.uartpins=-DUARTREMAP
atxy6o.menu.uartpins.alternate.bootloader.uartswap=_alt
atxy6o.menu.uartpins.standard.build.uartpins=
atxy6o.menu.uartpins.standard.bootloader.uartswap=
atxy6o.menu.twipins.standard=SDA:8, SCL:9
atxy6o.menu.twipins.alternate=SDA:14, SCL:15
atxy6o.menu.twipins.alternate.build.twipins=-DTWIREMAP
atxy6o.menu.twipins.standard.build.twipins=
atxy6o.menu.spipins.standard=SCK:16, MISO:15, MOSI:14
atxy6o.menu.spipins.alternate=SCK:10, MISO:11, MOSI:12
atxy6o.menu.spipins.alternate.build.spipins=-DSPIREMAP
atxy6o.menu.spipins.standard.build.spipins=

